mohammednazmy/rovac/hardware/esp32_motor_wireless/sdkconfig.defaults
# ESP32-WROOM-32E (Maker ESP32) — Motor Wireless defaults
# Flash: 4MB DIO, No PSRAM, UART0 console (CH340)

# Target
CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# No PSRAM on WROOM-32E
CONFIG_SPIRAM=n

# Partition table — custom CSV
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS — 1000Hz tick, dual-core
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1

# Console via UART0 (default — connected to CH340 USB-UART bridge)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Log level — INFO
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Watchdog — increase task WDT for WiFi reconnect delays
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# UART ISR in IRAM
CONFIG_UART_ISR_IN_IRAM=y

# Newlib — nano printf (saves flash)
CONFIG_NEWLIB_NANO_FORMAT=y

# micro-ROS — WiFi UDP transport to Agent on Pi
CONFIG_MICRO_ROS_ESP_XRCE_DDS_MIDDLEWARE=y
CONFIG_MICRO_ROS_ESP_NETIF_WLAN=y
CONFIG_ESP_WIFI_SSID="Hurry"
CONFIG_ESP_WIFI_PASSWORD="Gaza@2023"
CONFIG_ESP_MAXIMUM_RETRY=5
CONFIG_MICRO_ROS_AGENT_IP="192.168.1.200"
CONFIG_MICRO_ROS_AGENT_PORT="8888"
